Documents/ДокПриходКомплектующих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ДокПриходКомплектующих</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвижениеОсновныхДеталей</xr:Item>
				<xr:Item>AccumulationRegister.НаСклад</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолДеталей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасходныеДетали</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеДетали</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>шт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>упаковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДокПриходКомплектующих/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПроцедурыФормы

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Объект.Дата = ТекущаяДата();
		СложитьВсе();
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура СложитьВсе()
		Объект.СуммаДокумента = Объект.РасходныеДетали.Итог("Сумма")+Объект.ОсновныеДетали.Итог("Цена");
		Объект.КолДеталей = Объект.РасходныеДетали.Итог("Количество")+Объект.ОсновныеДетали.Количество();
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыТабличнойЧастиРасходныеДетали

	&НаКлиенте
	Процедура СуммаРасходныхСредств()
		ТД = Элементы.Комплектующие.ТекущиеДанные;
		Если Элементы.КомплектующиеКоличествоКоробок.Видимость Тогда
			ТД.Сумма = ТД.Цена*ТД.КоличествоКоробок;
		Иначе
			ТД.Сумма = ТД.Цена*ТД.Количество;
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеЦенаПриИзменении(Элемент)
		СуммаРасходныхСредств();
		СложитьВсе();
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеКоличествоПриИзменении(Элемент)
		СуммаРасходныхСредств();	
		СложитьВсе();
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеСуммаПриИзменении(Элемент)
		СложитьВсе();
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеПослеУдаления(Элемент)
		СложитьВсе()
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеЕдИзмПриИзменении(Элемент)
		ТД = Элементы.Комплектующие.ТекущиеДанные;
		Если ТД.ЕдИзм = ПолучитьПеречисленияВУпаковке() тогда
			Элементы.КомплектующиеКоличествоКоробок.Видимость = истина;
			Элементы.КомплектующиеВУпаковке.Видимость = истина;
		Иначе 
			Элементы.КомплектующиеКоличествоКоробок.Видимость = ложь;
			Элементы.КомплектующиеВУпаковке.Видимость = ложь;
		КонецЕсли;		
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеКоличествоКоробокПриИзменении(Элемент)
		ТД = Элементы.Комплектующие.ТекущиеДанные;
		ТД.Количество = ТД.КоличествоКоробок*ТД.ВУпаковке;
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеВУпаковкеПриИзменении(Элемент)
		ТД = Элементы.Комплектующие.ТекущиеДанные;
		ТД.Количество = ТД.КоличествоКоробок*ТД.ВУпаковке;
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыТабличнойЧастиОсновныеДетали

&НаКлиенте
Процедура КомплектующиеСирийныйНомерПриИзменении(Элемент)
	//ТД = Элементы.Комплектующие.ТекущиеДанные;
	//Если ТД.Количество >1 тогда
	//	ТД.СерийныйНомер = "";
	//	Сообщить("Более одной детали с одинаковым серийным номером не может быть!");
	//КонецЕсли;
КонецПроцедуры

	&НаКлиенте
	функция ПроверкаНаПовторы(ТД)
		Для Индекс = 0 по Объект.ОсновныеДетали.Количество() - 2 цикл
			Строка = Объект.ОсновныеДетали.Получить(Индекс);
			Если ТД.Деталь = Строка.Деталь и ТД.СерийныйНомер = Строка.СерийныйНомер тогда
				Возврат Индекс+1;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат 0;	
	КонецФункции

	&НаКлиенте
	Процедура ОсновныеДетали1ЦенаПриИзменении(Элемент)
		СложитьВсе();
	КонецПроцедуры

	&НаКлиенте
	Процедура ОсновныеДетали1ДетальПриИзменении(Элемент)
		СложитьВсе();
		ТД = Элементы.ОсновныеДетали1.ТекущиеДанные;
		НомерСтрокиСПовтором = ПроверкаНаПовторы(ТД);
		если НомерСтрокиСПовтором > 0 тогда
			Сообщить("Деталь "+ТД.Деталь+" с номером "+ТД.СерийныйНомер+" уже прописана в этом документе под номером "+НомерСтрокиСПовтором+".");
			ТД.Деталь = "";
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ОсновныеДетали1СерийныйНомерПриИзменении(Элемент)
		ТД = Элементы.ОсновныеДетали1.ТекущиеДанные;
		НомерСтрокиСПовтором = ПроверкаНаПовторы(ТД);
		если НомерСтрокиСПовтором>0 тогда
			Сообщить("Деталь "+ТД.Деталь+" с номером "+ТД.СерийныйНомер+" уже прописана в этом документе под номером "+НомерСтрокиСПовтором+".");
			ТД.СерийныйНомер = "";
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ОсновныеДетали1ПослеУдаления(Элемент)
		СложитьВсе()
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести

	//Получить перечисление единицы измерения
	&НаСервере
	функция ПолучитьПеречисленияВУпаковке()
		Возврат Перечисления.ЕдиницыИзмерения.упаковка;
	КонецФункции

#КонецОбласти
